Revit 2024 API
DockablePane.Id Property
 The unique identifier for this dockable pane.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public DockablePaneId Id { get; }
Visual Basic
Public ReadOnly Property Id As DockablePaneId
	Get
Visual C++
public:
property DockablePaneId^ Id {
	DockablePaneId^ get ();
}
See Also
DockablePane Class
Autodesk.Revit.UI Namespace